Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: You can use static methods on `QuarkusTransaction` to define transaction boundaries. This provides two different options, a functional approach that allows you to run a lambda within the scope of a transaction, or by using explicit `begin`, `commit` and `rollback` methods.
zh_cn: 你可以使用 `QuarkusTransaction` 上的静态方法来定义事务边界。这提供了两种不同的选择，一种是允许你在事务范围内运行lambda的函数式方法，或者通过使用显式的 `begin` 、 `commit` 和 `rollback` 方法。

source: You can use that generated UUID as the consumer group as follows:
zh_cn: 您可以使用生成的UUID作为消费者组id，如下所示：

source: You can use the JPA entity manager directly. Panache proposes an alternative removing boilerplate and exposing an active record and repository models.
zh_cn: 你可以直接使用JPA实体管理器。Panache提出了一个替代方案，去掉了模板，暴露了一个活跃的记录和存储库模型。

source: You can use the MongoDB client in a native executable.
zh_cn: 你可以在一个本地可执行文件中使用MongoDB客户端。

source: You can use the following command as usual:
zh_cn: 您可以像往常一样使用以下命令：

source: You can use the generated pair of keys instead of the keys used in this quickstart.
zh_cn: 你可以使用生成的这对密钥，而不是本快速入门中使用的密钥。

source: You can use the same approach as described in the xref:security-openid-connect.adoc#integration-testing[OpenID Connect Bearer Token Integration testing] `Local Public Key` section but only change the `application.properties` to use MP JWT configuration properties instead:
zh_cn: 你可以使用与 link:security-openid-connect.html#integration-testing.adoc[OpenID Connect承载令牌集成测试] `Local Public Key` 部分所述的相同方法，只需改变 `application.properties` ，使用MP JWT配置属性代替：

source: You can use the standard Quarkus `@Transactional` annotation on tests, but this means that the changes your test makes to the database will be persistent. If you want any changes made to be rolled back at the end of the test you can use the `io.quarkus.test.TestTransaction` annotation. This will run the test method in a transaction, but roll it back once the test method is complete to revert any database changes.
zh_cn: 您可以在测试中使用标准的Quarkus `@Transactional` 注解，但这意味着您的测试对数据库的改变将是持久的。如果您想在测试结束时回滚所做的任何改变，您可以使用 `io.quarkus.test.TestTransaction` 注释。这将在一个事务中运行测试方法，但一旦测试方法完成，事务就会回滚从而以恢复所有数据库变化。

source: You can use them if you want, but we also support what we call **PanacheQL** that can be seen as a subset of link:https://docs.oracle.com/javaee/7/tutorial/persistence-querylanguage.htm#BNBTG[JPQL] (or link:https://docs.jboss.org/hibernate/orm/5.4/userguide/html_single/Hibernate_User_Guide.html#hql[HQL]) and allows you to easily express a query. MongoDB with Panache will then map it to a MongoDB native query.
zh_cn: 如果你愿意，你可以使用它们，但我们也支持所谓的 **PanacheQL** ，它可以被看作是 link:https://docs.oracle.com/javaee/7/tutorial/persistence-querylanguage.htm#BNBTG[JPQL] （或 link:https://docs.jboss.org/hibernate/orm/5.4/userguide/html_single/Hibernate_User_Guide.html#hql[HQL] ）的一个子集，并允许你轻松地表达一个查询。使用Panache的MongoDB会将其映射为MongoDB的原生查询。

source: You can verify ID and access JWT tokens by using the refreshable JSON Web Key (JWK) set or you can introspect them remotely. However, opaque (binary) tokens can only be introspected remotely.
zh_cn: 您可以使用可刷新的 `JWK` 密钥集验证ID和访问 `JWT` token。但JWT和不透明（二进制）token都可以被远程自省(introspect)。

source: You can write your mocking test like this:
zh_cn: 你可以像这样写你的模拟测试。

source: You cannot combine the `quarkus-oidc` `Bearer` and `smallrye-jwt` authentication mechanisms because both mechanisms attempt to verify the token extracted from the HTTP `Authorization Bearer` scheme.
zh_cn: 但结合 `quarkus-oidc` `Bearer` 和 `smallrye-jwt` 认证机制是不允许的，因为两者都试图验证从HTTP `Authorization Bearer` scheme中提取的token。

source: You cannot mix ranges and pages: if you use a range, all methods that depend on having a current page will throw an `UnsupportedOperationException`; you can switch back to paging using `page(Page)` or `page(int, int)`.
zh_cn: 你不能混合使用ranges和pages：如果你使用range，所有依赖于拥有当前页面的方法将抛出一个 `UnsupportedOperationException` ；你可以使用 `page(Page)` 或 `page(int, int)` 切换回分页。

source: You cannot use `@Transactional` with Hibernate Reactive for your transactions: you must use `@ReactiveTransactional`, and your annotated method must return a `Uni` to be non-blocking. Otherwise it needs be called from a non-`VertxThread` thread and will become blocking.
zh_cn: 在Hibernate Reactive中，不能对事务使用 `@Transactional` 注解，必须使用 `@ReactiveTransactional` ，而且被注解的方法必须返回一个 `Uni` ，才能保证方法是非阻塞的。否则，Quarkus会用一个非 `VertxThread` 的线程调用这个方法，并使它阻塞。

source: You cannot use `UserTransaction` in a method having a transaction started by a `@Transactional` call.
zh_cn: 你不能在一个由 `@Transactional` 控制事务启动的方法中使用 `UserTransaction` 。

source: You create an Hibernate entity instance from this payload,
zh_cn: 您从这个payload中创建一个Hibernate实体对象,

source: You don't have to inject the `vertx` instance; instead, leverage the protected field from `AbstractVerticle`.
zh_cn: 你不需要注入 `vertx` 实例；相反，你可以利用 `AbstractVerticle` 的受保护字段。

source: You don't have to reply to received messages. Typically, for a _fire and forget_ interaction, the messages are consumed, and the sender does not need to know about it. To implement this pattern, your consumer method returns `void`.
zh_cn: 你不需要回复收到的消息。通常情况下，对于 _fire 和 forget_ 交互来说，消息被消耗掉了，发送者不需要知道这件事。为了实现这种模式，你的消费者方法返回 `void` 类型 。

source: You don't need to worry about setting it up most of the time as extensions needing it will simply add it as a dependency. Hibernate ORM for example will include the transaction manager and set it up properly.
zh_cn: 在大多数情况下，你不需要担心设置它，因为需要它的扩展会简单地把它作为一个依赖项加入。例如，Hibernate ORM将包括事务管理器并对其进行正确设置。

source: You have found nowhere.<br/>The pathway to normal space<br/>is found in the nav.
zh_cn: 没有找到您要访问的资源。<br/>请通过导航栏返回到正常空间。

source: You have noticed how much more compact and readable the code is compared to using the MongoDB API? Does this look interesting? Read on!
zh_cn: 你是否注意到与使用MongoDB API相比，代码更加紧凑和可读？这看起来是不是很有趣？请继续阅读!

source: You have noticed how much more compact and readable the code is? Does this look interesting? Read on!
zh_cn: 你有注意到代码的紧凑性和可读性大大提高了吗？看起来很有趣吧？请继续阅读!

source: You inject the channel representing the Kafka topic in your HTTP endpoint
zh_cn: 您在您的HTTP节点中注入代表Kafka topic的 channel

source: You just need to run both applications using:
zh_cn: 你只需使用以下命令运行这两个应用程序：

source: You may need to configure the `link-name` attribute, if the queue name is not the channel name:
zh_cn: 如果队列名称不是通道名称，你可能需要配置 `link-name` 属性：

source: You may want to build the native executable directly in a container without having a final container containing the build tools. That approach is possible with a multi-stage Docker build:
zh_cn: 你可能想直接在一个容器中构建原生可执行文件，而不需要一个包含构建工具的最终容器。这种方法可以通过多阶段的Docker构建来实现：

source: You might need to add it as a dependency explicitly if you are using transactions directly without Hibernate ORM for example. Add the following to your build file:
zh_cn: 如果你不使用Hibernate ORM而直接使用事务，你可能需要明确地将其作为一个依赖项加入，例如。在你的构建文件中添加以下内容：

source: You must also force your AWS service client for SQS, SNS, S3 et al, to use the URL Connection client, which connects to AWS services over HTTPS, hence the inclusion of the SSL enabled property, as described in the <<https>> section above.
zh_cn: 你还必须强制你的SQS、SNS、S3等AWS服务客户端使用URL Connection客户端，其通过HTTPS连接到AWS服务，因此包含启用了SSL的属性，如上面 link:#https[[https]] 部分中所述。

source: You need <a href="https://en.wikipedia.org/wiki/Comparison_of_integrated_development_environments#Java" target="_blank">an IDE</a> like <a href="https://www.jetbrains.com/idea/download/">IntelliJ IDEA</a>, <a href="https://www.eclipse.org/downloads/">Eclipse</a>, <a href="https://code.visualstudio.com/Download">VSCode</a> or even <a href="https://spacevim.org/use-vim-as-a-java-ide/">Vim</a> or <a href="http://spacemacs.org">Emacs</a>!
zh_cn: 您需要<a href="https://en.wikipedia.org/wiki/Comparison_of_integrated_development_environments#Java" target="_blank">一个IDE</a>，比如<a href="https://www.jetbrains.com/idea/download/">IntelliJ IDEA</a>，<a href="https://www.eclipse.org/downloads/">Eclipse</a>、<a href="https://code.visualstudio.com/Download">VSCode</a>或者至少有一个<a href="https://spacevim.org/use-vim-as-a-java-ide/">Vim</a>、<a href="http://spacemacs.org">Emacs</a>文本编辑器！

source: You need <a href="https://maven.apache.org/" target="_blank">Apache Maven {{ site.data.versions.maven }}</a>
zh_cn: 您需要<a href="https://maven.apache.org/" target="_blank">Apache Maven {{ site.data.version.maven }}</a>

source: You need <a href="https://maven.apache.org/" target="_blank">Apache Maven {{ site.data.versions.maven }}</a> or <a href="https://gradle.org/" target="_blank">Gradle</a>
zh_cn: 您需要<a href="https://maven.apache.org/" target="_blank">Apache Maven {{ site.data.version.maven }}</a>或<a href="https://gradle.org/" target="_blank">Gradle</a>

source: You need a <a href="https://adoptopenjdk.net" target="_blank">a JDK {{ site.data.versions.jdk }}</a> (any distribution)
zh_cn: 您需要一个<a href="https://adoptopenjdk.net" target="_blank">JDK {{ site.data.version.jdk }}</a>（任意发行版）

source: You need a deserializer that can create a `Fruit` from the record. This can be done using a Jackson deserializer:
zh_cn: 您需要一个能从记录中创建 `Fruit` 实例的反序列化器。可以使用Jackson的反序列化器来完成：

source: You need clustering support for your scheduled tasks? This guide explains how to use the Quartz extension for that.
zh_cn: 你的计划任务需要集群支持？本指南解释了如何使用Quartz扩展来实现这一点。

source: You need the following configuration:
zh_cn: 你需要以下配置：

source: You need to use the JAAS `PlainLoginModule`.
zh_cn: 您需要使用JAAS `PlainLoginModule` 。

source: You often need to execute custom actions when the application starts and clean up everything when the application stops. This guide explains how to be notified when an application stops or starts.
zh_cn: 你经常需要在应用程序启动时执行自定义动作，在应用程序停止时清理一切。本指南解释了如何在应用程序停止或启动时获得通知。

source: You persist that entity into a database,
zh_cn: 您将该实体持久化到数据库中,

source: You receive an HTTP request with a payload,
zh_cn: 您收到一个带有payload的HTTP请求,

source: You return that channel as a `Publisher` or a `Multi` from the HTTP method
zh_cn: 您将该 channel 作为一个 `Publisher` 或 `Multi` 从HTTP方法中返回

source: You send the entity to a Kafka topic
zh_cn: 您把实体发送到一个Kafka topic中

source: You should be able to access your Keycloak Server at http://localhost:8180[localhost:8180].
zh_cn: 你应该能够通过 http://localhost:8180[localhost:8180] 访问你的Keycloak服务器。

source: You should be able to access your Keycloak Server at https://localhost:8543[localhost:8543].
zh_cn: 现在您应该可以在 link:https://localhost:8543[localhost:8543] 访问您的Keycloak服务器了。

source: You should get the expected `Hello bob` message back.
zh_cn: 你应该会收到预期的 `Hello bob` 消息。

source: You should not call methods annotated with `@Incoming` and/or `@Outgoing` directly from your code. They are invoked by the framework. Having user code invoking them would not have the expected outcome.
zh_cn: 您不应该在您的代码中直接调用被标记了 `@Incoming` 和/或 `@Outgoing` 注解的方法。它们会被框架调用。如果在用户代码中调用将不会得到预期的结果。

source: You should only use `list` and `stream` methods if your collection contains small enough data sets. For larger data sets you can use the `find` method equivalents, which return a `PanacheQuery` on which you can do paging:
zh_cn: 如果你的集合包含足够小的数据集，你应该只使用 `list` 和 `stream` 方法。对于较大的数据集，你可以使用 `find` 方法来替代，它返回一个 `PanacheQuery` ，你可以对其进行分页。

source: You should only use `list` and `stream` methods if your table contains small enough data sets. For larger data sets you can use the `find` method equivalents, which return a `PanacheQuery` on which you can do paging:
zh_cn: 如果你的表数据量很小，你应该只用到 `list` 和 `stream` 方法。对于较大的数据集，你可以使用对应的 `find` 方法，它返回一个 `PanacheQuery` ，可以对其进行分页查询操作：

source: You should only use the `list` methods if your table contains small enough data sets. For larger data sets you can use the `find` method equivalents, which return a `PanacheQuery` on which you can do paging:
zh_cn: 如果你的表数据量很小，你应该只用到 `list` 方法。对于较大的数据集，你可以使用对应的 `find` 方法，它返回一个 `PanacheQuery` ，可以对其进行分页查询操作：

source: You should see the content of the file printed in the console.
zh_cn: 你应该会在控制台中看到打印的文件内容。

source: You will also have to explicitly configure Vert.x to use the native transport. In `application.properties` add:
zh_cn: 你还必须明确地配置Vert.x来使用本地传输。在 `application.properties` 中添加：

source: You will be allowed to use the following annotations to customize this mapping:
zh_cn: 你将被允许使用以下注解来自定义这种映射：

source: You will be asked to log in into a `Single Page Application` provided by `OpenID Connect Dev UI`:
zh_cn: 您将被要求登录到由 `OpenID Connect Dev UI` 提供的 `Single Page Application` ：

source: You will have access to the same functionalities of the _imperative_ variant inside the reactive one: bson annotations, custom ID, PanacheQL, ... But the methods on your entities or repositories will all return reactive types.
zh_cn: 你可以在 _imperative_ 变形中使用同样的功能：Bson注释、自定义ID、PanacheQL......但是你的实体或资源库上的方法将全部返回响应式类型。

source: You will then need to specify your own provider to configure and initialize the MeterRegistry, as discussed in the next section.
zh_cn: 然后，您将需要指定自定义的provider来配置和初始化MeterRegistry，我们将在下一节讨论。

source: Your REST method then looks like this:
zh_cn: 你的 REST 方法如下所示：

source: Your application may have additional requirements. For example, if you have an application that requires `libfreetype.so`, you need to copy the native libraries to the container. In this case, you need to use a multi-stage `dockerfile` to copy the required libraries:
zh_cn: 你的应用程序可能有其他的额外要求。例如，如果你有一个依赖于 `libfreetype.so` 的应用程序，你需要将本地库拷贝到容器当中。在这种情况下，你需要使用一个多阶段的 `dockerfile` 来拷贝所需要的依赖库:

source: Your decision to choose whether to use opaque or JWT token format will be driven by architectural considerations. Opaque tokens tend to be much shorter than JWT tokens but need most of the token-associated state to be maintained in the provider database. Opaque tokens are effectively database pointers. JWT tokens are significantly longer than the opaque tokens but the providers are effectively delegating storing most of the token-associated state to the client by storing it as the token claims and either signing or encrypting them.
zh_cn: 请注意，选择使用不透明 token 还是JWT token 格式通常是由架构考虑驱动的。不透明 token 通常比JWT token 短得多，但它们需要在提供者的数据库中维护大部分的 token 相关状态。不透明 token 实际上就是数据库指针。JWT token 比不透明 token 要长得多，但提供者通过将大部分 token 相关状态存储为 token 声明并对其进行签名或加密从而有效地将其委托给客户端。

source: Your endpoints can return `Uni` or `Multi` instances:
zh_cn: 你的节点可以返回 `Uni` 或 `Multi` 实例。

source: Your final archive will look like this:
zh_cn: 你的最终档案将看起来像这样：

source: Your help is more than welcome! Don’t hesitate to join the crowd.
zh_cn: 我们非常欢迎您的帮助！不要犹豫，加入我们大家吧。

source: Your implemented provider must be a CDI bean. Here's an example:
zh_cn: 您实现的提供者必须是一个CDI bean。这里是一个例子:

source: Zero config, live reload in the blink of an eye
zh_cn: 零配置，瞬间重新加载

source: [Jekyll static site generator docs](https://jekyllrb.com/docs/).
zh_cn: [Jekyll 静态站点生成器文档](https://jekyllrb.com/docs/).

source: _For more information about how to install the Quarkus CLI and use it, please refer to xref:cli-tooling.adoc[the Quarkus CLI guide]._
zh_cn: _关于如何安装并使用Quarkus CLI的更多信息，请参考xref:cli-tooling.adoc[Quarkus CLI指南]。_

source: _Mutiny_ verticle - Java classes extending `io.smallrye.mutiny.vertx.core.AbstractVerticle`
zh_cn: _Mutiny_ verticle - 扩展的Java类 `io.smallrye.mutiny.vertx.core.AbstractVerticle`

source: _Please test this carefully on compilation to native images and fallback to Java-compatible Jackson bindings if you experience problems._
zh_cn: _请在编译到native-image时仔细测试，如果遇到问题，请退回到与Java兼容的Jackson binding。_

source: _Reactive_ is a set of principles to build robust, efficient, and concurrent applications and systems. These principles let you handle more load than traditional approaches while using the resources (CPU and memory) more efficiently while also reacting to failures gracefully.
zh_cn: _Reactive_ 是一组用于构建健壮、高效且并发的应用程序和系统的原则。 这些原则使您可以处理比传统方法更多的负载，同时更有效地使用资源（CPU 和内存），同时还可以优雅地对故障做出反应。

source: __On the JVM, if the generated class needs to have a parameterless constructor, default values for all properties have to be specified (see Constructors).__
zh_cn: __在JVM上，如果生成的类需要有一个无参数的构造函数，就必须为所有属性指定默认值（见构造函数）。__

source: _bare_ verticle - Java classes extending `io.vertx.core.AbstractVerticle`
zh_cn: _bare_ verticle - 延伸的Java类 `io.vertx.core.AbstractVerticle`

source: _deprecated_ - During the readiness health check, the connector connects to the broker and retrieves the list of topics. This attribute specifies the maximum duration (in ms) for the retrieval. If exceeded, the channel is considered not-ready. Deprecated: Use 'health-topic-verification-timeout' instead. Type: _long_
zh_cn: _已废弃_ - 在就绪状态健康检查期间，连接器会连接到broker并获取主题列表。这个属性指定了获取操作的最大耗时（ms）。如果超时，通道会被认为是没有就绪的。已废弃：使用'health-topic-verification-timeout'代替。 类型: _long_

source: _deprecated_ - Whether the readiness check should verify that topics exist on the broker. Default to false. Enabling it requires an admin connection. Deprecated: Use 'health-topic-verification-enabled' instead. Type: _boolean_
zh_cn: _已废弃_ - 就绪检查是否应该验证broker上是否存在主题。默认为false。启用它需要一个管理员连接。已废弃：请使用 'health-topic-verification-enabled' 代替。 类型: _boolean_

source: `/vertx/book` returns the content from a large file (a book)
zh_cn: `/vertx/book` 返回一个大文件的内容（一本书）

source: `/vertx/hello` uses the Vert.x event bus to produce the response
zh_cn: `/vertx/hello` 使用Vert.x事件总线来生成响应

source: `/vertx/lorem` returns the content from a small file
zh_cn: `/vertx/lorem` 返回一个小文件的内容

source: `/vertx/web` uses the Vert.x Web Client to retrieve data from Wikipedia
zh_cn: `/vertx/web` 使用Vert.x Web客户端从维基百科中检索数据

source: `0` will result in the use of a random port (assigned by the operating system).
zh_cn: 设置为 `0` 则会使用随机端口（由操作系统分配）。

source: `<query>` will expand to `delete from EntityName where <query>`
zh_cn: `<query>` 语句会被扩展为： `delete from EntityName where <query>`

source: `<query>` will expand to `from EntityName where <query>`
zh_cn: `<query>` 语句会被扩展为： `from EntityName where <query>`

source: `<query>` will expand to `{<query>}` where we will map the PanacheQL query to MongoDB native query form. We support the following operators that will be mapped to the corresponding MongoDB operators: 'and', 'or' ( mixing 'and' and 'or' is not currently supported), '=', '>', '>=', '<', '<=', '!=', 'is null', 'is not null', and 'like' that is mapped to the MongoDB `$regex` operator (both String and JavaScript patterns are supported).
zh_cn: `<query>` 将扩展到 ，在这里我们将把PanacheQL查询映射到MongoDB原生查询形式。我们支持以下运算符，它们将被映射为相应的MongoDB运算符：'and'、 'or'（目前不支持 'and' 和 'or'一起使用）、'='、'>'、'>='、 '<'、'<='、'!='、'is null'、'is not null' 和 'like' 映射到 MongoDB `regex` 运算符（支持字符串和 JavaScript 模式）

source: `<singleColumnName>` (and single parameter) which will expand to `delete from EntityName where <singleColumnName> = ?`
zh_cn: `<singleColumnName>` (带单个参数）语句会被扩展为： `delete from EntityName where <singleColumnName> = ?`

source: `<singleColumnName>` (and single parameter) which will expand to `from EntityName where <singleColumnName> = ?`
zh_cn: `<singleColumnName>` (带单个参数）语句会被扩展为： `from EntityName where <singleColumnName> = ?`

source: `<singlePropertyName>` (and single parameter) which will expand to `{'singleColumnName': '?1'}`
zh_cn: `<singlePropertyName>` (和单一参数），这将扩展为 `{'singleColumnName': '?1'}`

source: `<singlePropertyName>` (and single parameter) which will expand to the update document `{'$set' : {'singleColumnName': '?1'}}`
zh_cn: `<singlePropertyName>` (和单一参数），这将扩展到更新文档 `{'$set' : {'singleColumnName': '?1'}}`

source: `<suppress until="2022-01-01Z">...</suppress>` You can adjust the expiry date if you need to.
zh_cn: `<suppress until="2022-01-01Z">...</suppress>` 如果需要您可以调整过期时间。

source: `@ApplicationScoped`, `@Singleton` and `@RequestScoped` outer bean injection scopes are all supported when an `org.eclipse.microprofile.jwt.JsonWebToken` is injected, with the `@RequestScoped` scoping for `JsonWebToken` enforced to ensure the current token is represented.
zh_cn: 这里 `@ApplicationScoped` , `@Singleton` 和 `@RequestScoped` 外层Bean注入作用域在注入 `org.eclipse.microprofile.jwt.JsonWebToken` 时都是被支持的， `@RequestScoped` 作用域对 `JsonWebToken` 强制执行，以确保当前令牌被呈现。

source: `@BsonId`: allows you to customize the ID field, see <<custom-ids,Custom IDs>>.
zh_cn: `@BsonId` ：允许你自定义ID字段，见 link:#custom-ids[自定义ID] 。

source: `@BsonIgnore`: ignore a field during the serialization.
zh_cn: `@BsonIgnore` ：在序列化过程中忽略一个字段。

source: `@BsonProperty`: customize the serialized name of the field.
zh_cn: `@BsonProperty` ：自定义字段的序列化名称。

source: `@InjectKafkaCompanion` injects the `KafkaCompanion` instance, configured to access the Kafka broker created for tests.
zh_cn: `@InjectKafkaCompanion` 注入了 `KafkaCompanion` 实例，并被配置为可访问为测试目的而创建的Kafka broker。

source: `@InjectMock` results in a mock being and is available in test methods of the test class (other test classes are *not* affected by this)
zh_cn: `@InjectMock` 可以生成一个mock并使其在测试类的所有测试方法中可用（其他测试 类*不受* 此影响）

source: `@QuarkusIntegrationTest` should be used to launch and test the artifact produced by the Quarkus build, and supports testing a jar (of whichever type), a native image or container image. Put simply, this means that if the result of a Quarkus build (`mvn package` or `gradle build`) is a jar, that jar will be launched as `java -jar ...` and tests run against it. If instead a native image was built, then the application is launched as `./application ...` and again the tests run against the running application. Finally, if a container image was created during the build (by including the `quarkus-container-image-jib` or `quarkus-container-image-docker` extensions and having the `quarkus.container-image.build=true` property configured), then a container is created and run (this requires the `docker` executable being present).
zh_cn: `@QuarkusIntegrationTest` 应该被用来启动和测试由Quarkus构建产生的物件，而且支持测试一个jar（无论哪种类型），一个本地镜像或容器镜像。简单地说，这意味着如果Quarkus构建（ `mvn package` 或者 `gradle build`）的结果是一个jar，这个jar将以 `java -jar ...` 方式启动 ，并针对它运行测试。如果构建的是一个本地镜像，那么应用程序将以 `./application ...` 方式启动，并再次针对运行中的应用程序进行测试。最后，如果在构建过程中创建了一个容器镜像（通过引入 `quarkus-container-image-jib` 或 `quarkus-container-image-docker` 扩展并使用了 `quarkus.container-image.build=true` 属性），那么将创建并运行一个容器（这需要 `docker` 可执行文件的存在）。

source: `@QuarkusIntegrationTest` supports executing tests against an already running instance of the application. This can be achieved by setting the `quarkus.http.test-host` system property when running the tests.
zh_cn: `@QuarkusIntegrationTest` 支持对已经在运行的应用程序实例执行测试。这可以通过在运行测试时设置 `quarkus.http.test-host` 属性来实现。

source: `@QuarkusTest` has support for hang detection to help diagnose any unexpected hangs. If no progress is made for a specified time (i.e. no JUnit callbacks are invoked) then Quarkus will print a stack trace to the console to help diagnose the hang. The default value for this timeout is 10 minutes.
zh_cn: `@QuarkusTest` 支持挂起侦测，以帮助诊断任何意外的挂起。如果在指定的时间内没有进展（即没有调用JUnit回调），那么Quarkus将打印一个堆栈跟踪到控制台以帮助诊断挂起。这个超时的默认值是10分钟。

source: `@RestStreamElementType(MediaType.APPLICATION_JSON)` tells RESTEasy Reactive to serialize the object in JSON.
zh_cn: `@RestStreamElementType(MediaType.APPLICATION_JSON)` 告诉RESTEasy Reactive将对象序列化为JSON格式。

source: `@Transactional(MANDATORY)`: fails if no transaction was started ; works within the existing transaction otherwise.
zh_cn: `@Transactional(MANDATORY)` ：如果没有启动任何事务，则失败；否则在现有事务中工作。

source: `@Transactional(NEVER)`: if a transaction was started, raises an exception ; otherwise works with no transaction.
zh_cn: `@Transactional(NEVER)` :如果一个事务被启动，引发一个异常；否则在没有事务的情况下工作。

source: `@Transactional(NOT_SUPPORTED)`: if a transaction was started, suspends it and works with no transaction for the boundary of the method ; otherwise works with no transaction.
zh_cn: `@Transactional(NOT_SUPPORTED)` 暂停事务：如果一个事务已经开始，则暂停事务，并在方法的边界内不使用事务；否则不使用事务。

source: `@Transactional(REQUIRED)` (default): starts a transaction if none was started, stays with the existing one otherwise.
zh_cn: `@Transactional(REQUIRED)` (默认）：如果当前没有事务，则启动一个事务，否则保持现有的事务。
